{
  "alfredsnippet" : {
    "snippet" : "In modern world, information is produced and stored in digits explosively. There are various media of information, such as news pages, blogs, micro blogs, web pages, scientific papers, books, pictures, sounds, videos, social networks etc. The diversity of media induces both diversity and complexity of structures of information. Thus we need more efficient and automated tools to help us better organize, search and understand large amounts of information. \rIn order to cope with those multi-dimensional data, we have to address two problems. The first problem is how to represent meta data, for example, author, or location POI. The second one is how to exploit multi-dimensional information to provide a more intelligent and refined service. \rThe contributions of this paper are as follows: \rThis paper summarized all the model for representing text semantically based on meta data such as author, and compared advantages and disadvantages of these models. \rAuthor-topic model based on Hierarchical Dirichlet Process is proposed in the paper. The model is an non-parametric model which solves problem in infinity parameter space. That means the model can adapt to the number of topics according to corpus size. Traditional author-topic model need to do model selection usually by cross validation of varying different number of topics. Every time corpus size increase, traditional author-topic model had to train from scratch, while our model can be trained sequentially. \rThis paper also proposed a method to estimate the author-topic model based on Hierarchical Dirichlet Process. The estimated mothed can be used in other models based on Hierarchical Dirichlet Process and meta data. \rThe author-topic model based on Hierarchical Dirichlet Process performed the best among all the models. It is important that the model can be applied to modeling other meta data such as location, name entity etc. ",
    "uid" : "E0C0391F-43C9-4E0F-A1EA-1EFA36692871",
    "name" : "英文摘要",
    "keyword" : "ywzy"
  }
}